package my.day05.a.multifor_1;
/*
				== 구구단 ==            
2*1=2   3*1=3   4*1=4   ....   9*1=9
2*2=4   3*2=6   4*2=8   ....   9*2=18
2*3=6   3*3=9   4*3=12   ....   9*3=27
2*4=8   3*4=12   4*4=16   ....   9*4=36
2*5=10   3*5=15   4*5=20   ....   9*5=45
2*6=12   3*6=18   4*6=24   ....   9*6=54
2*7=14   3*7=21   4*7=28   ....   9*7=63
2*8=16   3*8=24   4*8=32   ....   9*8=72
2*9=18   3*9=27   4*9=36   ....   9*9=81
*/
public class Main_gugudan_3 {

	public static void main(String[] args) {
		
		System.out.printf("%s님의 나이는 %d세이고 신장은 %f 입니다.\n", "이순신", 25 , 180.92);
		
		
		System.out.println("			== 구구단 ==            ");
		
		System.out.printf("%30s\n", "== 구구단 ==");
		// 글자크기를 30만큼 잡아준 후  오른쪽 정렬로 == 구구단 ==을 채워준다 
		//_____________________== 구구단 ==
	
		System.out.printf("%30s\n", "== 구구단 ==");
		// 글자크기를 30만큼 잡아준 후  왼쪽 정렬로 == 구구단 ==을 채워준다 
		//== 구구단 ==_____________________
		
		System.out.printf("%25s\n", "== 구구단 ==");
		
		for(int i =2; i<=9; i++) {
			for(int j = 1; j<=9; j++) {
				
				System.out.printf(j + "*" + i + " =%-4d ", i*j);
				
			}
			System.out.print("\n");
		}
	
	
	
	
	
	}//end of main
}
